GetAS11702007
Syntax
SapObject.SapModel.Func.FuncRS.GetAS11702007
VB6 Procedure
Function GetAS11702007(ByVal Name As String, ByRef AS2007SiteClass As Long, ByRef AS2007kp As Double, ByRef AS2007Z As Double, ByRef AS2007Sp As Double, ByRef AS2007Mu As Double, ByRef DampRatio As Double) As Long
Parameters
Name
The name of a AS 1170 2007 response spectrum function.
AS2007SiteClass
This is 1, 2, 3, 4 or 5, indicating the site class.
1 = A
2 = B
3 = C
4 = D
5 = E
AS2007kp
The probability factor, kp.
AS2007Z
The hazard factor, Z.
AS2007Sp
The structural performance factor, Sp.
AS2007Mu
The structural ductility factor, u.
DampRatio
The damping ratio for the function, 0 <= DampRatio < 1.
Remarks
This function retrieves the definition of an AS 1170 2007 response spectrum function.
The function returns zero if the function definition is successfully retrieved; otherwise it returns a nonzero value.
VBA Example
Sub GetRSFuncAS11702007()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim AS2007SiteClass As Long
 Dim AS2007kp As Double
 Dim AS2007Z As Double
 Dim AS2007Sp As Double
 Dim AS2007Mu As Double
 Dim DampRatio As Double
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'add AS 1170 2007 RS function
 ret = SapModel.Func.FuncRS.SetAS11702007("RS-1", 3, 1.3, 0.9, 0.77, 2, 0.04)
 'get AS 1170 2007 RS function
 ret = SapModel.Func.FuncRS.GetAS11702007("RS-1", AS2007SiteClass, AS2007kp, AS2007Z, AS2007Sp, AS2007Mu, DampRatio)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 14.00.
See Also
SetAS11702007